Revit 2024 API
ElectricalSystem.ApparentCurrentPhaseC Property
 The ApparentCurrentPhaseC value of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double ApparentCurrentPhaseC { get; }
Visual Basic
Public ReadOnly Property ApparentCurrentPhaseC As Double
	Get
Visual C++
public:
property double ApparentCurrentPhaseC {
	double get ();
}
Remarks
 This property is used to retrieve the ApparentCurrentPhaseC value of the Electrical System.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This property only available when System Type is Power!
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace